cf/DataProcessors/нсиУправлениеНастройкамиФормУниверсальногоХранилища.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<DataProcessor>
		<Properties>
			<Name>нсиУправлениеНастройкамиФормУниверсальногоХранилища</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf/Enums/нсиВидыСправочников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>нсиВидыСправочников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФункциональныйСправочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодчиненныйСправочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Классификатор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/нсиВидыСправочников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>нсиВидыСправочников</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Иерархический</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСправочника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиВидыСправочников</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСправочника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.нсиВидыСправочников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БыстрыйВыбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пояснение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРеквизитПредставления</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаПредставления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборВФормеСписка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЗаявки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьНормализацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКлассификацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИерархии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.нсиВидыИерархииСправочников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Классификатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиВидыСправочников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитПредставления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиПредопределенныеРеквизиты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПолногоНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДопКлассификацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДляГруппы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.нсиВидыСправочников</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предопределенный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.нсиПредопределенныеРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребоватьЗаполнения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Многострочный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/DataProcessors/нсиУправлениеНастройкамиФормУниверсальногоХранилища/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ПравоДоступа("Администрирование", Метаданные) Тогда
		Для каждого ПользовательИБ Из ПользователиИнформационнойБазы.ПолучитьПользователей() Цикл
			Элементы.Пользователь.СписокВыбора.Добавить(ПользовательИБ.Имя);
		КонецЦикла;
	Иначе
		Элементы.Пользователь.Доступность = Ложь;
		Элементы.ФормаСкопировать.Доступность = Ложь;
	КонецЕсли;
	Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	
	ЗаполнитьФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	ЗаполнитьФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Скопировать(Команда)
	Если Элементы.Формы.ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Для копирования нужно выбрать настройки, которые требуется скопировать.'"));
		Возврат;
	КонецЕсли;
	
	СписокПользователей = Элементы.Пользователь.СписокВыбора.Скопировать();
	Если СписокПользователей.Количество() = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Невозможно скопировать настройки, так как в системе не заведен ни один пользователь.'"));
		Возврат;
	КонецЕсли;
	ЭлементСписка = СписокПользователей.НайтиПоЗначению(Пользователь);
	Если ЭлементСписка <> Неопределено Тогда
		СписокПользователей.Удалить(ЭлементСписка);
	КонецЕсли;
	
	ОписаниеОповещения = новый ОписаниеОповещения("ОбработкаОтметкиЭлементов",ЭтаФорма);
	СписокПользователей.ПоказатьОтметкуЭлементов(ОписаниеОповещения,НСтр("ru = 'Отметьте пользователей, которым нужно скопировать настройки'"));
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтметкиЭлементов(Список, ДП) Экспорт
	Если Список <> Неопределено Тогда
		ПользователиПриемник = Новый Массив;
		Для Каждого Элемент Из Список Цикл
			Элементы.Пользователь.СписокВыбора.НайтиПоЗначению(Элемент.Значение).Пометка = Элемент.Пометка;
			Если Элемент.Пометка Тогда
				ПользователиПриемник.Добавить(Элемент.Значение);
			КонецЕсли;
		КонецЦикла;
		
		Если ПользователиПриемник.Количество() = 0 Тогда
			ПоказатьПредупреждение(,НСтр("ru = 'Для копирования нужно отметить пользователей, которым требуется скопировать настройки.'"));
			Возврат;
		КонецЕсли;
		
		ТекстВопроса = НСтр("ru = 'После копирования настроек пользователю форма у пользователя будет открываться с настройками, которые ему скопируются. При этом его собственные настройки будут потеряны. Вы действительно хотите скопировать настройки выбранным пользователям?'");
		ОписаниеОповещения = новый ОписаниеОповещения("ОбработкаОтветаКопированиеНастроек",ЭтаФорма,ПользователиПриемник);
		ПоказатьВопрос(ОписаниеОповещения,ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаКопированиеНастроек(Результат,ПользователиПриемник) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		СкопироватьНастройки(ПользователиПриемник);
		ПоказатьОповещениеПользователя(НСтр("ru = 'Настройки скопированы'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	Если Элементы.Формы.ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Для удаления нужно выбрать настройки, которые требуется удалить.'"));
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'После удаления настроек форма будет открываться с настройками по умолчанию. Вы действительно хотите удалить настройки?'");
	ОписаниеОповещения = новый ОписаниеОповещения("ОбработкаОтветаУдалениеНастроек",ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещения,ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да)
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаУдалениеНастроек(Результат,ДП) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		УдалитьНастройки();
		ЗаполнитьФормы();
		ПоказатьОповещениеПользователя(НСтр("ru = 'Настройки удалены'"));
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СкопироватьНастройки(СписокПользователей)
	// Обработка = Обработк.УправлениеНастройкамиФорм.Создать();
	// Обработка.СкопироватьНастройкиФорм(Пользователь, СписокПользователей, ПолучитьМассивНастроек());
КонецПроцедуры

&НаСервере
Процедура УдалитьНастройки()
	// Обработка = Обработки.УправлениеНастройкамиФорм.Создать();
	// Обработка.УдалитьНастройкиФорм(Пользователь, ПолучитьМассивНастроек());
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормы()
	Формы.Очистить();
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Виды.Наименование,
	|	Виды.Ссылка
	|ИЗ
	|	Справочник.нсиВидыСправочников КАК Виды
	|ГДЕ
	|	Виды.ВидСправочника <> ЗНАЧЕНИЕ(Перечисление.нсиВидыСправочников.ТабличнаяЧасть)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Виды.Наименование";
	
	Выб = Запрос.Выполнить().Выбрать();
	СтОтбора = Новый Структура("КлючОбъекта,Пользователь", Неопределено, Пользователь);
	Пока Выб.Следующий() Цикл
		ИмяФормыНастройки = "ВнешняяОбработка._"+СтрЗаменить(XMLСтрока(Выб.Ссылка), "-", "")+".Форма.ФормаСписка";
		СтОтбора.КлючОбъекта = ИмяФормыНастройки+"/НастройкиФормы";
		ВыбНастроек = ХранилищеСистемныхНастроек.Выбрать(СтОтбора);
		Если ВыбНастроек.Следующий() Тогда
			Формы.Добавить(ИмяФормыНастройки, Выб.Наименование+".Форма списка");
		КонецЕсли;
		
		ИмяФормыНастройки = "ВнешняяОбработка._"+СтрЗаменить(XMLСтрока(Выб.Ссылка), "-", "")+".Форма.ФормаЭлемента";
		СтОтбора.КлючОбъекта = ИмяФормыНастройки+"/НастройкиФормы";
		ВыбНастроек = ХранилищеСистемныхНастроек.Выбрать(СтОтбора);
		Если ВыбНастроек.Следующий() Тогда
			Формы.Добавить(ИмяФормыНастройки, Выб.Наименование+".Форма элемента");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
